Revit 2027 API
CurtainGrid.GetPanel Method
 Get the specified panel located by the intersection of the grid lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Panel GetPanel(
	ElementId uGridLineId,
	ElementId vGridLineId
)
Public Function GetPanel (
	uGridLineId As ElementId,
	vGridLineId As ElementId
) As Panel
public:
Panel^ GetPanel(
	ElementId^ uGridLineId,
	ElementId^ vGridLineId
)
member GetPanel :
        uGridLineId : ElementId *
        vGridLineId : ElementId -> Panel
Parameters
uGridLineId ElementId
 The id of a grid line in the U-direction used to locate the panel.
vGridLineId ElementId
 The id of a grid line in the V-direction used to locate the panel.
Return Value
Panel
 The panel, or null if the panel cannot be found at this intersection.
See Also
Reference
CurtainGrid Class
Autodesk.Revit.DB Namespace